###############################################################################
#
# Created by PrimeTime write_sdc on Fri Apr 24 23:20:59 2026
#
###############################################################################

set sdc_version 2.1

set_units -time ns -capacitance pF -current mA -voltage V -resistance kOhm
###############################################################################
#  
# Units
# capacitive_load_unit           : 1 pF
# current_unit                   : 0.001 A
# resistance_unit                : 1 kOhm
# time_unit                      : 1 ns
# voltage_unit                   : 1 V
###############################################################################
set_operating_conditions -analysis_type on_chip_variation  -library [get_libs \
 {N16ADFP_StdCellff0p88vm40c_ccs.db:N16ADFP_StdCellff0p88vm40c_ccs}]  -min \
 ff0p88vm40c  -max ff0p88vm40c 
###############################################################################
# Clock Related Information
###############################################################################
create_clock -name clk -period 5 -waveform { 0 2.5 } [get_ports {clk}]
set_clock_latency -min  0.15 [get_clocks {clk}]
set_clock_latency -max  0.15 [get_clocks {clk}]
set_clock_latency -source -max  0.08 [get_clocks {clk}]
set_clock_latency -source -min  0.08 [get_clocks {clk}]
set_clock_uncertainty -setup  0.1 [get_clocks {clk}]
set_clock_uncertainty -hold  0.05 [get_clocks {clk}]
set_clock_transition -rise -max  0.06 [get_clocks {clk}]
set_clock_transition -fall -max  0.06 [get_clocks {clk}]
set_clock_transition -rise -min  0.06 [get_clocks {clk}]
set_clock_transition -fall -min  0.06 [get_clocks {clk}]
###############################################################################
# Point to Point exceptions
###############################################################################
set_false_path -from [get_ports {rst_n}] 
set_false_path -from [get_ports {scan_en}] 
set_false_path -to [get_ports {gclk_out[3] gclk_out[2] gclk_out[1] gclk_out[0]}]
###############################################################################
# External Delay Information
###############################################################################
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {activity_pulse[3]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {activity_pulse[2]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {activity_pulse[1]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {activity_pulse[0]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {wake_evt[3]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {wake_evt[2]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {wake_evt[1]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {wake_evt[0]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[31]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[30]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[29]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[28]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[27]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[26]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[25]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[24]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[23]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[22]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[21]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[20]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[19]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[18]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[17]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[16]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[15]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[14]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[13]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[12]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[11]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[10]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[9]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[8]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[7]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[6]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[5]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[4]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[3]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[2]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[1]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_addr[0]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[31]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[30]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[29]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[28]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[27]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[26]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[25]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[24]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[23]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[22]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[21]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[20]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[19]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[18]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[17]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[16]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[15]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[14]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[13]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[12]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[11]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[10]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[9]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[8]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[7]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[6]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[5]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[4]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[3]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[2]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[1]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_wdata[0]}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_we}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_re}]
set_input_delay  2 -clock [get_clocks {clk}] [get_ports {scan_en}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[31]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[30]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[29]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[28]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[27]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[26]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[25]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[24]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[23]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[22]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[21]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[20]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[19]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[18]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[17]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[16]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[15]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[14]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[13]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[12]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[11]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[10]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[9]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[8]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[7]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[6]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[5]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[4]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[3]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[2]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[1]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {cfg_rdata[0]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {gclk_out[3]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {gclk_out[2]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {gclk_out[1]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {gclk_out[0]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {state[7]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {state[6]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {state[5]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {state[4]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {state[3]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {state[2]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {state[1]}]
set_output_delay  2 -clock [get_clocks {clk}] [get_ports {state[0]}]
set_clock_gating_check -rise -setup  0.15 
set_clock_gating_check -fall -setup  0.15 
set_load -pin_load  0.04 [get_ports {cfg_rdata[31]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[30]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[29]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[28]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[27]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[26]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[25]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[24]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[23]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[22]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[21]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[20]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[19]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[18]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[17]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[16]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[15]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[14]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[13]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[12]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[11]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[10]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[9]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[8]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[7]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[6]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[5]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[4]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[3]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[2]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[1]}]
set_load -pin_load  0.04 [get_ports {cfg_rdata[0]}]
set_load -pin_load  0.04 [get_ports {gclk_out[3]}]
set_load -pin_load  0.04 [get_ports {gclk_out[2]}]
set_load -pin_load  0.04 [get_ports {gclk_out[1]}]
set_load -pin_load  0.04 [get_ports {gclk_out[0]}]
set_load -pin_load  0.04 [get_ports {state[7]}]
set_load -pin_load  0.04 [get_ports {state[6]}]
set_load -pin_load  0.04 [get_ports {state[5]}]
set_load -pin_load  0.04 [get_ports {state[4]}]
set_load -pin_load  0.04 [get_ports {state[3]}]
set_load -pin_load  0.04 [get_ports {state[2]}]
set_load -pin_load  0.04 [get_ports {state[1]}]
set_load -pin_load  0.04 [get_ports {state[0]}]
set_max_area 0
set_max_capacitance  0.12 [current_design]
set_max_fanout  16 [current_design]
set_max_transition  0.25 [current_design]
###############################################################################
# POCV Information
###############################################################################
